# Run `brew bundle -v` to install all of this.
# Run `brew bundle cleanup -v --force` to remove all the garbage.

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'gentlecat/personal'

# The shell
brew 'fish'
brew 'starship'

# Programming languages and environments
brew 'elixir'
brew 'go'
brew 'node'
brew 'python'
brew 'rbenv'
brew 'typescript'

# Essentials
brew 'coreutils'
brew 'moreutils'
brew 'vim', args: ['with-override-system-vi', 'with-python3', 'without-perl', 'with-custom-ruby']

# Dev tools
#brew 'postgresql', args: ['with-python3', 'without-perl']
brew 'ack' # A better grep
brew 'docker-compose'
brew 'gcc'
brew 'git-extras'
brew 'git-secrets'
brew 'git'
brew 'gpg'
brew 'grep'
brew 'hub' # GitHub tools (supposed to be used as an alias for `git`)
brew 'llvm'
brew 'sqlite'
brew 'yarn'

# Utilities
brew 'exa' # `ls` replacement
brew 'ffmpeg'
brew 'graphviz'
brew 'httpie'
brew 'jrnl'
brew 'libgxps' # Includes XPS to PDF converter
brew 'mosh', args: ['HEAD']
brew 'pv' # Pipe Viewer
brew 'screen'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tldr'
brew 'tor'
brew 'tree'
brew 'youtube-dl' # Video downloader
brew 'zopfli'

brew 'gentlecat/personal/clippy', args: ['HEAD']
brew 'gentlecat/personal/publisher', args: ['HEAD']


#########
# Casks #
#########

tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade' # https://github.com/buo/homebrew-cask-upgrade

#cask 'gas-mask'
#cask 'tunnelbear'
#cask 'osxfuse'
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'calibre' # Book library management
cask 'disk-inventory-x'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'garmin-express'
cask 'handbrake' # Video converter
cask 'imageoptim'
cask 'iterm2'
cask 'little-snitch'
cask 'macs-fan-control'
cask 'mactex-no-gui'
cask 'mendeley-desktop'
cask 'plex-media-player'
cask 'softu2f'
cask 'sonos'
cask 'sony-ps4-remote-play' # PS4 Remote Play
cask 'spotify'
cask 'steam'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'vlc'

# Comms
cask 'amazon-chime'
cask 'discord'
cask 'signal'
cask 'telegram'
cask 'whatsapp'

# Development tools
#cask 'virtualbox'
cask 'android-platform-tools'
cask 'db-browser-for-sqlite'
cask 'fork'
cask 'insomnia'
cask 'jetbrains-toolbox'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'wireshark'

# Browsers
#cask 'chromium'
#cask 'google-chrome-canary'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'tor-browser'


########
# Misc #
########

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-go-mono'
