# Run `brew bundle -v` to install all of this.
# Run `brew bundle cleanup -v --force` to remove all the garbage.
# Run `brew uninstall --zap <PACKAGE>` to remove a specific package before deleting it from this list.


# The shell
brew 'fish'
brew 'atuin'


#############
# Dev tools #
#############

brew 'ack' # A better grep
brew 'bat' # Clone of cat(1) with syntax highlighting and Git integration
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'duf' # Disk Usage/Free Utility - a better 'df' alternative
brew 'eza' # Modern, maintained replacement for ls
brew 'fd' # Simple, fast and user-friendly alternative to find
brew 'git'
brew 'git-extras'
brew 'git-secrets'
brew 'grep'
brew 'helix'
brew 'iperf3' # Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew 'lazygit' # Simple terminal UI for git commands
brew 'mosh'
brew 'pv' # Pipe Viewer
brew 'the_silver_searcher' # Code-search similar to ack
brew 'tlrc' # Simplified and community-driven man pages
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'vim'
brew 'yarn'

cask 'ghostty'

# Programming languages and environments
brew 'deno'
brew 'elixir'
brew 'go'
brew 'node'
brew 'python'
brew 'rust'
brew 'rust-analyzer'
brew 'rustfmt'
brew 'typescript'
cask 'corretto'

# Containers
brew 'docker'
brew 'docker-compose'
brew 'docker-buildx'
brew 'podman'
cask 'podman-desktop'

# IDEs and editors
cask 'android-platform-tools'
cask 'arduino-ide'
cask 'db-browser-for-sqlite'
cask 'insomnia'
cask 'jetbrains-toolbox'
cask 'zed'


###############
# Other utils #
###############

brew 'ansible'
brew 'exiftool' # Perl lib for reading and writing EXIF metadata
brew 'ffmpeg'
brew 'httpie'
brew 'jrnl'
brew 'tectonic' # Modernized, complete, self-contained TeX/LaTeX engine
brew 'typst' # Markup-based typesetting system
brew 'yt-dlp' # Feature-rich command-line audio/video downloader

cask '1password'
cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'audacity'
cask 'calibre'
cask 'darktable'
cask 'flux'
cask 'freecad'
cask 'garmin-express'
cask 'handbrake'
cask 'imageoptim'
cask 'inkscape'
cask 'kicad'
cask 'little-snitch' # free alternative: lulu
cask 'macs-fan-control'
cask 'monitorcontrol'
cask 'mullvadvpn'
cask 'netiquette'
cask 'nextcloud'
cask 'obs'
cask 'openscad'
cask 'orcaslicer'
cask 'raspberry-pi-imager'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'vlc'
cask 'wireshark'
cask 'zotero'

# Infosec
brew 'ffuf' # Fast web fuzzer written in Go
brew 'gobuster' # Directory/file & DNS busting tool written in Go
brew 'nmap' # Port scanning utility for large networks
brew 'subfinder' # Subdomain discovery tool

# Browsers
cask 'firefox@developer-edition'
cask 'google-chrome'
cask 'librewolf'
cask 'mullvad-browser'
cask 'orion'
cask 'tor-browser'

# Fonts
cask 'font-fira-code'
cask 'font-go'
cask 'font-iosevka'
cask 'font-spline-sans-mono'

# Comms
cask 'discord'
cask 'signal'
cask 'telegram'
cask 'whatsapp'

# Gaming
cask 'moonlight'
cask 'sony-ps-remote-play'
cask 'steam'

tap 'gentlecat/personal'
brew 'gentlecat/personal/clippy', args: ['HEAD']
# brew 'gentlecat/personal/publisher', args: ['HEAD']
