# Run `brew bundle -v` to install all of this.
# Run `brew bundle cleanup -v --force` to remove all the garbage.

tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'yt-dlp/taps'
tap 'gentlecat/personal'

# The shell
brew 'fish'

# Programming languages and environments
brew 'elixir'
cask 'corretto'
brew 'go'
brew 'node'
brew 'python'
brew 'rbenv'
brew 'typescript'
brew 'rust'
brew 'rust-analyzer'
brew 'rustfmt'

# Essentials
brew 'coreutils'
brew 'moreutils'
brew 'vim'

# Dev tools
brew 'ack' # A better grep
brew 'bat' # Clone of cat(1) with syntax highlighting and Git integration
brew 'duf' # Disk Usage/Free Utility - a better 'df' alternative
brew 'eza' # Modern, maintained replacement for ls
brew 'fd' # Simple, fast and user-friendly alternative to find
brew 'gcc'
brew 'gh'
brew 'git-extras'
brew 'git-secrets'
brew 'git'
brew 'gpg'
brew 'grep'
brew 'iperf3'
brew 'sqlite'
brew 'yarn'

# Utilities
brew 'ffmpeg'
brew 'graphviz'
brew 'httpie'
brew 'jrnl'
brew 'libgxps' # Includes XPS to PDF converter
brew 'mosh'
brew 'pv' # Pipe Viewer
brew 'screen'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tldr'
brew 'tor'
brew 'tree'
brew 'yt-dlp/taps/yt-dlp' # Video downloader
brew 'zopfli'

brew 'gentlecat/personal/clippy', args: ['HEAD']
# brew 'gentlecat/personal/publisher', args: ['HEAD']


#########
# Casks #
#########

tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade' # https://github.com/buo/homebrew-cask-upgrade

cask '1password'
cask 'adobe-acrobat-reader'
cask 'appcleaner'
cask 'audacity'
cask 'blockblock'
cask 'calibre'
cask 'flux'
cask 'garmin-express'
cask 'handbrake'
cask 'imageoptim'
cask 'inkscape'
cask 'iterm2'
cask 'kicad'
cask 'knockknock'
cask 'little-snitch' # free alternative: lulu
cask 'macs-fan-control'
cask 'mactex-no-gui'
cask 'monitorcontrol'
cask 'moonlight'
cask 'mullvadvpn'
cask 'netiquette'
cask 'nextcloud'
cask 'obs'
cask 'raspberry-pi-imager'
cask 'rectangle'
cask 'reikey'
cask 'sonos'
cask 'spotify'
cask 'steam'
cask 'suspicious-package'
cask 'taskexplorer'
cask 'the-unarchiver'
cask 'via'
cask 'vlc'
cask 'zotero'

# Comms
cask 'discord'
cask 'signal'
cask 'telegram'
cask 'whatsapp'

# Development tools
cask 'android-platform-tools'
cask 'db-browser-for-sqlite'
cask 'docker'
cask 'insomnia'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'wireshark'

# Browsers
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'tor-browser'
cask 'arc'


########
# Misc #
########

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-go'
